Repository: mindoroevo/RepoReader
Catalog: lib/l10n/app_*.arb
Languages: de, es, fr, it, ja, nl, pt, ru, zh

# tokenReasonRateLimits
source: Without token you only get 60 anonymous API calls per hour (rate limit). With PAT: 5,000 per hour and access to private repositories (if permitted).
de: Ohne Token hast du nur 60 anonyme API-Aufrufe pro Stunde (Rate Limit). Mit PAT: 5.000 pro Stunde und Zugriff auf private Repositories (falls Rechte).
es: Sin token solo 60 llamadas anónimas por hora (límite). Con PAT: 5.000 por hora y acceso a repos privados (si permisos).
fr: Sans jeton seulement 60 appels anonymes/heure. Avec PAT : 5 000/heure et accès privé (si autorisé).
it: Senza token solo 60 chiamate anonime/ora. Con PAT: 5.000/ora e accesso privato (se permesso).
ja: Token がない場合、匿名 API 呼び出しは 1 時間に 60 回までです。PAT を使用すると 1 時間に 5,000 回まで、かつプライベート Repository にもアクセス可能です。
nl: Zonder token slechts 60 anonieme calls/uur. Met PAT: 5.000/uur en toegang tot privé (indien rechten).
pt: Sem token apenas 60 chamadas anônimas/hora. Com PAT: 5.000/hora e acesso a privados (se permitido).
ru: Без Token вы можете выполнять только 60 анонимных API-запросов в час. С PAT: до 5000 запросов в час и доступ к приватным репозиториям (при правах).
zh: 无 Token 时，每小时仅可进行 60 次匿名 API 调用。使用 PAT 可提升至每小时 5000 次，并可访问私有仓库（若授权）。

# createTokenSteps
source: Create a token:
de: So erstellst du ein Token:
es: Crear un token:
fr: Créer un jeton :
it: Crea un token:
ja: Token の作成手順:
nl: Token aanmaken:
pt: Criar um token:
ru: Как создать Token:
zh: 创建 Token 的步骤：

# tokenStep1
source: Open GitHub → Settings → Developer settings → Personal access tokens.
de: Öffne GitHub → Settings → Developer settings → Personal access tokens.
es: Abre GitHub → Settings → Developer settings → Personal access tokens.
fr: Ouvrez GitHub → Settings → Developer settings → Personal access tokens.
it: Apri GitHub → Settings → Developer settings → Personal access tokens.
ja: GitHub → Settings → Developer settings → Personal access tokens を開く。
pt: Abra GitHub → Settings → Developer settings → Personal access tokens.
ru: Откройте GitHub → Settings → Developer settings → Personal access tokens.
zh: 打开 GitHub → 设置 → 开发者设置 → Personal access tokens。

# tokenStep2
source: Choose fine-grained (or classic) PAT.
de: Wähle Fine-grained (oder Classic) PAT.
es: Elige PAT de alcance fino (o clásico).
fr: Choisissez un PAT affiné (ou classique).
it: Scegli PAT fine-grained (o classico).
ja: Fine-grained (または Classic) PAT を選択。
nl: Kies fine‑grained (of klassiek) PAT.
pt: Escolha PAT fine‑grained (ou clássico).
ru: Выберите Fine-grained (или Classic) PAT.
zh: 选择 Fine-grained（或 Classic）PAT。

# tokenStep3
source: Select repository (or grant access to all desired).
de: Wähle Repository (oder Zugriff auf alle gewünschten).
es: Selecciona repositorio (o accesos deseados).
fr: Sélectionnez le dépôt (ou accès souhaité).
it: Seleziona repository (o accessi desiderati).
ja: Repository (または必要なアクセス範囲) を選択。
nl: Selecteer repository (of gewenste toegang).
pt: Selecione repositório (ou acessos desejados).
ru: Выберите Repository (или нужные).
zh: 选择要授权的 Repository。

# tokenStep4
source: Scopes: For read-only access contents:read is sufficient (Classic: repo or just contents).
de: Scopes: Für reine Lesezugriffe reicht contents:read (Classic: repo oder nur contents).
es: Scopes: Para solo lectura basta contents:read (Clásico: repo o solo contents).
fr: Scopes : pour lecture seule contents:read suffit (Classique : repo ou seulement contents).
it: Scopes: per sola lettura basta contents:read (Classico: repo o solo contents).
ja: スコープ: 読み取り専用なら contents:read (Classic: repo または contents のみ) で十分。
nl: Scopes: voor alleen lezen is contents:read genoeg (Klassiek: repo of alleen contents).
pt: Scopes: para leitura contents:read basta (Clássico: repo ou só contents).
ru: Scopes: для чтения достаточно contents:read (Classic: repo или только contents).
zh: 权限范围：仅阅读内容时，选择 contents:read（Classic：repo 或仅 contents）。

# tokenStep5
source: Generate token and paste it here (stored locally).
de: Token erzeugen und hier einfügen (wird lokal gespeichert).
es: Genera token y pégalo aquí (se guarda localmente).
fr: Générez le jeton et collez‑le ici (stocké localement).
it: Genera token e incollalo qui (salvato localmente).
ja: Token を生成し、ここに貼り付けます（ローカルに保存されます）。
nl: Genereer token en plak het hier (lokaal opgeslagen).
pt: Gere o token e cole aqui (armazenado localmente).
ru: Создайте Token и вставьте его сюда (сохраняется локально).
zh: 生成 Token 并粘贴到此处（本地保存）。

source: Security note:
de: Sicherheitshinweis:
es: Nota de seguridad:
fr: Note de sécurité :
it: Nota di sicurezza:
ja: セキュリティ注意:
nl: Veiligheidsnotitie:
pt: Nota de segurança:
ru: Примечание по безопасности:
zh: 安全说明：

# tokenSecurityLocal
source: Token is stored only locally (SharedPreferences or secure storage) and only used for API calls. Prefer a restricted fine-grained PAT.
de: Token wird nur lokal (SharedPreferences oder Secure Storage) gehalten und nur für API Aufrufe genutzt. Nutze nach Möglichkeit ein eingeschränktes Fine-grained PAT.
es: El token solo se guarda localmente y solo para llamadas API. Usa un PAT limitado.
fr: Le jeton est stocké uniquement localement et uniquement pour les appels API. Utilisez un PAT restreint.
it: Il token è salvato solo localmente e usato solo per chiamate API. Usa un PAT limitato.
ja: Token はローカル (SharedPreferences または Secure Storage) にのみ保持され、API 呼び出しにのみ使用されます。可能であれば制限付き Fine-grained PAT を使用してください。
nl: Token alleen lokaal opgeslagen en enkel voor API. Gebruik een beperkt PAT.
pt: Token só local e apenas para chamadas API. Use um PAT restrito.
ru: Token хранится локально (SharedPreferences или Secure Storage) и используется только для API-запросов. При возможности используйте ограниченный Fine-grained PAT.
zh: Token 仅保存在本地（SharedPreferences 或 Secure Storage）并仅用于 API 调用。建议使用权限受限的 Fine-grained PAT。

# closeDialog
source: Close
de: Schließen
es: Cerrar
fr: Fermer
it: Chiudi
ja: 閉じる
nl: Sluiten
pt: Fechar
ru: Закрыть
zh: 关闭

# allDeleteConfirmTitle
source: Delete everything?
de: Alles löschen?
es: ¿Borrar todo?
fr: Tout supprimer ?
it: Eliminare tutto?
ja: すべて削除しますか？
nl: Alles verwijderen?
pt: Apagar tudo?
ru: Удалить всё?
zh: 删除所有？

# allDeleteConfirmContent
source: All cached content, change snapshots, favorites and configuration will be removed.
de: Alle gecachten Inhalte, Änderungs-Snapshots, Favoriten und Konfiguration werden entfernt.
es: Todo el contenido en caché, snapshots de cambios, favoritos y configuración serán eliminados.
fr: Tous les contenus en cache, snapshots de changements, favoris et configuration seront supprimés.
it: Tutti i contenuti cache, snapshot modifiche, preferiti e configurazione saranno rimossi.
ja: すべてのキャッシュ、変更スナップショット、お気に入り、設定が削除されます。
nl: Alle cache, wijzigingsmomentopnamen, favorieten en configuratie worden verwijderd.
pt: Todo cache, snapshots, favoritos e configuração serão removidos.
ru: Все кэшированные данные, снимки изменений, избранное и настройки будут удалены.
zh: 将删除所有缓存内容、更改快照、收藏与配置。

source: Delete
de: Löschen
es: Eliminar
fr: Supprimer
it: Elimina
ja: 削除
nl: Verwijderen
pt: Apagar
ru: Удалить
zh: 删除

# cancelSmall
source: Cancel
de: Abbrechen
es: Cancelar
fr: Annuler
it: Annulla
ja: キャンセル
nl: Annuleren
pt: Cancelar
ru: Отмена
zh: 取消

# couldNotInterpretLink
source: Could not interpret link. Expected for example https://github.com/OWNER/REPO or .../tree/BRANCH/docs
de: Konnte Link nicht interpretieren. Erwartet z.B. https://github.com/OWNER/REPO oder .../tree/BRANCH/docs
es: No se pudo interpretar el enlace. Se esperaba p.ej. https://github.com/OWNER/REPO o .../tree/BRANCH/docs
fr: Impossible d'interpréter le lien. Attendu p.ex. https://github.com/OWNER/REPO ou .../tree/BRANCH/docs
it: Impossibile interpretare il link. Atteso ad es. https://github.com/OWNER/REPO o .../tree/BRANCH/docs
ja: リンクを解釈できません。例: https://github.com/OWNER/REPO または .../tree/BRANCH/docs が必要です。
nl: Kon link niet interpreteren. Verwacht bijv. https://github.com/OWNER/REPO of .../tree/BRANCH/docs
pt: Não foi possível interpretar o link. Esperado ex. https://github.com/OWNER/REPO ou .../tree/BRANCH/docs
ru: Не удалось распознать ссылку. Ожидалось: https://github.com/OWNER/REPO или .../tree/BRANCH/docs
zh: 无法解析链接。应为例如：https://github.com/OWNER/REPO 或 .../tree/BRANCH/docs

source: Repository not found
de: Repository nicht gefunden
es: Repositorio no encontrado
fr: Dépôt introuvable
it: Repository non trovato
ja: Repository が見つかりません
nl: Repository niet gevonden
pt: Repositório não encontrado
ru: Repository не найден
zh: 未找到 Repository

# rateLimitReachedNeedToken
source: GitHub rate limit reached – please set a token (menu Auth / Token).
de: GitHub Rate Limit erreicht – bitte Token setzen (Menü Auth / Token).
es: Límite de GitHub alcanzado – establece un token (menú Auth / Token).
fr: Limite GitHub atteinte – définissez un jeton (menu Auth / Token).
it: Limite GitHub raggiunto – imposta un token (menu Auth / Token).
ja: GitHub レート制限に達しました – Token を設定してください (メニュー Auth / Token)。
nl: GitHub limiet bereikt – stel een token in (menu Auth / Token).
pt: Limite GitHub atingido – defina um token (menu Auth / Token).
ru: Достигнут лимит GitHub — укажите Token (меню Auth / Token).
zh: 达到 GitHub 速率限制 – 请设置 Token（菜单 Auth / Token）。

# accessDeniedPrivateOrToken
source: Access denied (private repo or token needed)
de: Zugriff verweigert (privates Repo oder Token nötig)
es: Acceso denegado (repo privado o necesita token)
fr: Accès refusé (dépôt privé ou jeton requis)
it: Accesso negato (repo privato o token necessario)
ja: アクセスが拒否されました (プライベート Repo または Token が必要)
nl: Toegang geweigerd (privé of token nodig)
pt: Acesso negado (privado ou precisa token)
ru: Доступ запрещён (приватный Repo или требуется Token)
zh: 访问被拒绝（私有仓库或需 Token）

# repoErrorHttp
source: Repo error: HTTP {code}
de: Repo Fehler: HTTP {code}
es: Error repo: HTTP {code}
fr: Erreur dépôt : HTTP {code}
it: Errore repo: HTTP {code}
ja: Repo エラー: HTTP {code}
nl: Repo fout: HTTP {code}
pt: Erro repo: HTTP {code}
ru: Ошибка Repo: HTTP {code}
zh: Repo 错误：HTTP {code}

# folderDoesNotExist
source: Folder "{dir}" does not exist in branch {branch}
de: Ordner "{dir}" existiert nicht im Branch {branch}
es: Carpeta "{dir}" no existe en la rama {branch}
fr: Dossier "{dir}" inexistant dans la branche {branch}
it: Cartella "{dir}" inesistente nel branch {branch}
ja: フォルダ "{dir}" は Branch {branch} に存在しません
nl: Map "{dir}" bestaat niet in branch {branch}
pt: Pasta "{dir}" não existe no branch {branch}
ru: Папка "{dir}" не существует в Branch {branch}
zh: 文件夹“{dir}”在 Branch {branch} 中不存在

# directoryAccessDenied
source: Directory access denied (private or rate limit)
de: Verzeichnis Zugriff verweigert (privat oder Rate Limit)
es: Acceso a directorio denegado (privado o límite)
fr: Accès dossier refusé (privé ou limite)
it: Accesso directory negato (privata o limite)
ja: ディレクトリアクセスが拒否されました (プライベートまたはレート制限)
nl: Maptoegang geweigerd (privé of limiet)
pt: Acesso diretório negado (privado ou limite)
ru: Доступ к директории запрещён (приватно или лимит)
zh: 目录访问被拒绝（私有或超出速率限制）

# directoryErrorHttp
source: Directory error: HTTP {code}
de: Verzeichnis Fehler: HTTP {code}
es: Error directorio: HTTP {code}
fr: Erreur dossier : HTTP {code}
it: Errore directory: HTTP {code}
ja: ディレクトリエラー: HTTP {code}
nl: Map fout: HTTP {code}
pt: Erro diretório: HTTP {code}
ru: Ошибка директории: HTTP {code}
zh: 目录错误：HTTP {code}

# validationFailed
source: Validation failed: {error}
de: Validierung fehlgeschlagen: {error}
es: Validación fallida: {error}
fr: Échec validation : {error}
it: Validazione fallita: {error}
ja: 検証に失敗しました: {error}
nl: Validatie mislukt: {error}
pt: Validação falhou: {error}
ru: Ошибка проверки: {error}
zh: 验证失败：{error}

# startDeviceFlow
source: Starting device flow...
de: Starte Device Flow...
es: Iniciando device flow...
fr: Démarrage device flow...
it: Avvio device flow...
ja: デバイスフローを開始中...
nl: Device flow starten...
pt: Iniciando device flow...
ru: Запуск Device Flow...
zh: 启动设备登录流程...

# enterCodeAt
source: Enter code at {url}
de: Code eingeben unter {url}
es: Introduce código en {url}
fr: Entrez le code sur {url}
it: Inserisci codice su {url}
ja: {url} でコードを入力
nl: Voer code in op {url}
pt: Insira código em {url}
ru: Введите код на {url}
zh: 在 {url} 输入代码

source: Waiting for grant...
de: Warte auf Freigabe...
es: Esperando autorización...
fr: En attente d'autorisation...
it: In attesa di autorizzazione...
ja: 承認を待っています...
nl: Wacht op toestemming...
pt: Aguardando autorização...
ru: Ожидание подтверждения...
zh: 等待授权...

source: Success – token stored
de: Erfolgreich – Token gespeichert
es: Éxito – token guardado
fr: Succès – jeton enregistré
it: Successo – token salvato
ja: 成功 – Token を保存しました
nl: Succes – token opgeslagen
pt: Sucesso – token salvo
ru: Успешно — Token сохранён
zh: 成功 – 已保存 Token

source: Token removed
de: Token entfernt
es: Token eliminado
fr: Jeton supprimé
it: Token rimosso
ja: Token を削除しました
nl: Token verwijderd
pt: Token removido
ru: Token удалён
zh: 已删除 Token

# autoBranchApplied
source: Branch automatically: {branch}
de: Branch automatisch: {branch}
es: Rama automáticamente: {branch}
fr: Branche automatiquement : {branch}
it: Branch automatico: {branch}
ja: 自動ブランチ: {branch}
nl: Branch automatisch: {branch}
pt: Branch automático: {branch}
ru: Автоматически выбран Branch: {branch}
zh: 自动应用 Branch：{branch}

source: No matches
de: Keine Treffer
es: Sin coincidencias
fr: Aucune correspondance
it: Nessuna corrispondenza
ja: 一致なし
nl: Geen overeenkomsten
pt: Sem correspondências
ru: Нет совпадений
zh: 无匹配结果

source: Adopt into link field
de: In Linkfeld übernehmen
es: Adoptar en campo enlace
fr: Reporter dans le champ lien
it: Inserisci nel campo link
ja: リンクフィールドに反映
nl: Overnemen in linkveld
pt: Adotar no campo link
ru: Вставить в поле ссылки
zh: 填入链接字段

# selectedLabel
source: Selected: {dir}
de: Gewählt: {dir}
es: Seleccionado: {dir}
fr: Sélectionné : {dir}
it: Selezionato: {dir}
ja: 選択済み: {dir}
nl: Geselecteerd: {dir}
pt: Selecionado: {dir}
ru: Выбрано: {dir}
zh: 已选择：{dir}

source: Will automatically use "docs".
de: Wird automatisch "docs" verwenden.
es: Usará automáticamente "docs".
fr: Utilisera automatiquement "docs".
it: Userà automaticamente "docs".
ja: 自動的に "docs" を使用します。
nl: Zal automatisch "docs" gebruiken.
pt: Usará automaticamente "docs".
ru: Автоматически будет использована папка "docs".
zh: 将自动使用“docs”文件夹。

source: Examples (neutral)
de: Beispiele (neutral)
es: Ejemplos (neutros)
fr: Exemples (neutres)
it: Esempi (neutri)
ja: 例 (中立)
nl: Voorbeelden (neutraal)
pt: Exemplos (neutros)
ru: Примеры (нейтральные)
zh: 示例（通用）

# recognizedPattern
source: Recognized pattern: owner / repo / (branch=main) / (dir=docs) – is extracted from the link and can be replaced by concrete values.
de: Erkanntes Muster: owner / repo / (branch=main) / (dir=docs) – wird aus dem Link extrahiert und kann durch konkrete Angaben ersetzt werden.
es: Patrón reconocido: owner / repo / (branch=main) / (dir=docs) – se extrae del enlace y puede sustituirse.
fr: Modèle reconnu : owner / repo / (branch=main) / (dir=docs) – extrait du lien.
it: Schema riconosciuto: owner / repo / (branch=main) / (dir=docs) – estratto dal link.
ja: 検出パターン: owner / repo / (branch=main) / (dir=docs) – リンクから抽出され、上書き可能です。
nl: Herkenpatroon: owner / repo / (branch=main) / (dir=docs) – uit link gehaald.
pt: Padrão reconhecido: owner / repo / (branch=main) / (dir=docs) – extraído do link.
ru: Распознан шаблон: owner / repo / (branch=main) / (dir=docs) — извлекается из ссылки и может быть изменён вручную.
zh: 识别的模式：owner / repo / (branch=main) / (dir=docs) – 从链接提取，可手动修改。

source: Wipe all
de: Alles
es: Todo
fr: Tout
it: Tutto
ja: すべて
nl: Alles
pt: Tudo
ru: Все
zh: 全部

# applyButton
source: Apply
de: Übernehmen
es: Aplicar
fr: Appliquer
it: Applica
ja: 適用
nl: Toepassen
pt: Aplicar
ru: Применить
zh: 应用

source: Reset
es: Restablecer
fr: Réinitialiser
it: Reimposta
ja: リセット
pt: Redefinir
ru: Сброс
zh: 重置

# githubRepoSearchTitle
source: GitHub repo search
de: GitHub Repo Suche
es: Búsqueda repo GitHub
fr: Recherche dépôt GitHub
it: Ricerca repo GitHub
ja: GitHub Repo 検索
nl: GitHub repo zoeken
pt: Pesquisa repo GitHub
ru: Поиск GitHub Repo
zh: GitHub 仓库搜索

# repositorySearchFieldLabel
source: Search repository (name or part)
de: Repository suchen (Name oder Teil)
es: Buscar repositorio (nombre o parte)
fr: Rechercher dépôt (nom ou partie)
it: Cerca repository (nome o parte)
ja: Repository を検索 (名前または一部)
nl: Repository zoeken (naam of deel)
pt: Buscar repositório (nome ou parte)
ru: Поиск Repository (имя или часть)
zh: 搜索 Repository（名称或部分）

# deviceLoginFlagNote
source: Note: Device login requires build flag GITHUB_CLIENT_ID
de: Hinweis: Device Login benötigt Build Flag GITHUB_CLIENT_ID
es: Nota: Device login requiere flag de build GITHUB_CLIENT_ID
fr: Note : la connexion appareil nécessite le flag GITHUB_CLIENT_ID
it: Nota: device login richiede flag GITHUB_CLIENT_ID
ja: 注意: デバイスログインには Build Flag GITHUB_CLIENT_ID が必要です
nl: Opmerking: apparaatlogin vereist flag GITHUB_CLIENT_ID
pt: Nota: device login requer flag GITHUB_CLIENT_ID
ru: Примечание: вход через устройство требует Build Flag GITHUB_CLIENT_ID
zh: 注意：设备登录需要 Build Flag GITHUB_CLIENT_ID

# atLeastNChars
source: min. {n} chars
de: mind. {n} Zeichen
es: mín. {n} caracteres
fr: min. {n} caractères
it: min. {n} caratteri
ja: 少なくとも {n} 文字
nl: min. {n} tekens
pt: mín. {n} caracteres
ru: не менее {n} символов
zh: 至少 {n} 个字符

source: Rate limit docs
de: Rate Limit Doku
es: Docs límite tasa
fr: Docs limite taux
it: Docs limite rate
ja: レート制限ドキュメント
nl: Limiet docs
pt: Docs limite taxa
ru: Документация по лимитам
zh: 速率限制文档

# fileTypeDialogTitle
source: Show file types
de: Dateitypen anzeigen
es: Mostrar tipos de archivo
fr: Afficher types de fichier
it: Mostra tipi di file
ja: ファイルタイプを表示
nl: Bestandstypen tonen
pt: Mostrar tipos de arquivo
ru: Показать типы файлов
zh: 显示文件类型

# onlyReadmeVisibleShort
source: Only README visible
de: Nur README sichtbar
es: Solo README visible
fr: Seulement README visible
it: Solo README visibile
ja: README のみ表示
nl: Alleen README zichtbaar
pt: Só README visível
ru: Только README
zh: 仅 README

# filterExtensionExample
source: Filter extension (e.g. png)
de: Extension filtern (z.B. png)
es: Filtrar extensión (p.ej. png)
fr: Filtrer extension (ex. png)
it: Filtra estensione (es. png)
ja: 拡張子でフィルター (例: png)
nl: Extensie filteren (bv. png)
pt: Filtrar extensão (ex. png)
ru: Фильтр по расширению (например, png)
zh: 按扩展名筛选（例如 png）

# fileTypeCountActive
source: {count} types active
de: {count} Typen aktiviert
es: {count} tipos activos
fr: {count} types actifs
it: {count} tipi attivi
ja: {count} タイプが有効
nl: {count} typen actief
pt: {count} tipos ativos
ru: Активно {count} типов
zh: 已启用 {count} 种类型

# fileTypeCategoryCode
source: Code
es: Código
it: Codice
ja: コード
pt: Código
ru: Код
zh: 代码

# fileTypeCategoryConfig
source: Configuration
de: Konfiguration
es: Configuración
it: Configurazione
ja: 設定
nl: Configuratie
pt: Configuração
ru: Конфигурация
zh: 配置

# fileTypeCategoryDocuments
source: Documents
de: Dokumente
es: Documentos
it: Documenti
ja: ドキュメント
nl: Documenten
pt: Documentos
ru: Документы
zh: 文档

# fileTypeCategoryImages
source: Images
de: Bilder
es: Imágenes
it: Immagini
ja: 画像
nl: Afbeeldingen
pt: Imagens
ru: Изображения
zh: 图片

# fileTypeCategoryMedia
source: Media
fr: Média
ja: メディア
pt: Mídia
ru: Медиа
zh: 媒体

# fileTypeCategoryArchives
source: Archives
de: Archive
es: Archivos
it: Archivi
ja: アーカイブ
nl: Archieven
pt: Arquivos
ru: Архивы
zh: 归档

# fileTypeCategoryOther
source: Other
de: Andere
es: Otros
fr: Autres
it: Altro
ja: その他
nl: Overige
pt: Outros
ru: Другое
zh: 其他

# openLicense
source: Open README license section
de: README (Lizenzabschnitt) öffnen
es: Abrir sección de licencia en README
fr: Ouvrir section licence dans README
it: Apri sezione licenza in README
ja: README (ライセンス項) を開く
ru: Открыть README (раздел лицензии)
zh: 打开 README（许可证部分）

# tipHomeModeTitle
source: Switch view
de: Ansicht wechseln
es: Cambiar vista
fr: Changer de vue
it: Cambia vista
ja: ビューを切り替え
ru: Сменить режим просмотра
zh: 切换视图

# tipHomeModeBody
source: Toggle between README navigation, flat all files, and tree explorer.
de: Zwischen README‑Navigation, flacher Liste und Explorer umschalten.
es: Cambiar entre navegación README, lista plana y explorador de árbol.
fr: Basculer entre navigation README, liste plate et explorateur d'arborescence.
it: Passa tra navigazione README, lista piatta e esploratore ad albero.
ja: README ナビゲーション、フラットリスト、エクスプローラーを切り替え。
ru: Переключайтесь между навигацией README, списком и проводником.
zh: 在 README 导航、平面列表和资源管理器间切换。

# tipHomeFilterTitle
source: Show file types
de: Dateitypen anzeigen
es: Mostrar tipos de archivo
fr: Afficher types de fichiers
it: Mostra tipi di file
ja: ファイルタイプを表示
ru: Типы файлов
zh: 显示文件类型

# tipHomeFilterBody
source: Filter or highlight additional file types besides Markdown.
de: Zusätzliche Dateitypen neben Markdown filtern/anzeigen.
es: Filtrar o resaltar tipos de archivo adicionales además de Markdown.
fr: Filtrer ou surligner types de fichiers supplémentaires outre Markdown.
it: Filtra o evidenzia tipi di file aggiuntivi oltre a Markdown.
ja: Markdown 以外のファイルタイプをフィルター / 表示します。
ru: Фильтруйте или показывайте дополнительные типы файлов помимо Markdown.
zh: 筛选或显示除 Markdown 外的其他文件类型。

# tipHomeSearchTitle
source: Search
de: Suche
es: Búsqueda
fr: Recherche
it: Ricerca
ja: 検索
ru: Поиск
zh: 搜索

# tipHomeSearchBody
source: Find content across filenames and Markdown text.
de: In Dateinamen und Markdown‑Inhalten suchen.
es: Buscar en nombres de archivo y contenido Markdown.
fr: Chercher dans noms de fichiers et contenu Markdown.
it: Cerca in nomi file e contenuto Markdown.
ja: ファイル名および Markdown 内容を検索。
ru: Ищите по именам и содержимому Markdown-файлов.
zh: 在文件名和 Markdown 内容中搜索。

# tipSetupLinkTitle
source: Paste GitHub link
de: GitHub‑Link einfügen
es: Pegar enlace GitHub
fr: Coller lien GitHub
it: Incolla link GitHub
ja: GitHub リンクを貼り付け
ru: Вставить ссылку GitHub
zh: 粘贴 GitHub 链接

# tipSetupLinkBody
source: Insert a repo URL. Owner, repo, branch and docs folder are auto-detected.
de: Repo‑URL einfügen. Owner, Repo, Branch und Docs‑Ordner werden automatisch erkannt.
es: Inserta URL de repo. Owner, repo, branch y carpeta docs se detectan automáticamente.
fr: Insérez URL de dépôt. Propriétaire, dépôt, branche et dossier docs détectés automatiquement.
it: Inserisci URL repo. Proprietario, repo, branch e cartella docs rilevati automaticamente.
ja: Repo URL を貼り付けると、Owner、Repo、Branch、Docs フォルダを自動検出します。
ru: Вставьте URL репозитория — Owner, Repo, Branch и папка Docs определяются автоматически.
zh: 粘贴仓库 URL，自动识别 Owner、Repo、Branch 和 Docs 文件夹。

# tipSetupSearchTitle
source: Search repositories
de: Repository suchen
es: Buscar repositorios
fr: Chercher dépôts
it: Cerca repository
ja: Repository を検索
ru: Поиск Repository
zh: 搜索 Repository

# tipSetupSearchBody
source: Type to find a repository and adopt it into the link field.
de: Tippe, um ein Repository zu finden und in das Linkfeld zu übernehmen.
es: Escribe para encontrar un repositorio y adoptarlo en el campo de enlace.
fr: Tapez pour trouver un dépôt et l'adopter dans le champ lien.
it: Digita per trovare un repository e adottarlo nel campo link.
ja: 入力して Repository を見つけ、リンク欄に反映します。
ru: Введите имя, чтобы найти Repository и вставить ссылку.
zh: 输入以查找 Repository 并填入链接字段。

# tipSetupDirTitle
source: Choose directory
de: Ordner wählen
es: Elegir directorio
fr: Choisir répertoire
it: Scegli directory
ja: フォルダを選択
ru: Выбор папки
zh: 选择文件夹
