Repository: mindoroevo/RepoReader
Catalog: lib/l10n/app_*.arb
Languages: de, es, fr, it, ja, nl, pt, ru, zh

# modePublic
source: Public (no token)
de: Öffentlich (ohne Token)
es: Público (sin token)
fr: Public (sans jeton)
it: Pubblico (nessun token)
ja: 公開 (Token なし)
nl: Publiek (geen token)
pt: Público (sem token)
ru: Публичный (без Token)
zh: 公开（无 Token）

# modeAuthenticated
source: Authenticated (token set)
de: Authentifiziert (Token gesetzt)
es: Autenticado (token configurado)
fr: Authentifié (jeton défini)
it: Autenticato (token impostato)
ja: 認証済み (Token 設定)
nl: Geauthenticeerd (token ingesteld)
pt: Autenticado (token definido)
ru: Аутентифицированный (с Token)
zh: 已验证（Token 已设置）

# pdfPreviewNotSupported
source: PDF preview not yet supported in the app
de: PDF-Vorschau in der App noch nicht unterstützt
es: Vista previa PDF aún no soportada
fr: Aperçu PDF pas encore supporté dans l'application
it: Anteprima PDF non ancora supportata
ja: PDF プレビューはアプリ内でまだサポートされていません
nl: PDF-voorbeeld nog niet ondersteund
pt: Pré-visualização de PDF ainda não suportada
ru: Предпросмотр PDF пока не поддерживается в приложении
zh: 应用中暂不支持 PDF 预览

# binaryFileHexPreview
source: Binary file - Hex preview (first 256 bytes):
de: Binärdatei - Hex Preview (erste 256 Bytes):
es: Archivo binario - Vista hex (primeros 256 bytes):
fr: Fichier binaire - Aperçu hex (premiers 256 octets):
it: File binario - Anteprima hex (primi 256 byte):
ja: バイナリファイル - Hex プレビュー (最初の 256 バイト):
nl: Binaire file - Hex voorbeeld (eerste 256 bytes):
pt: Arquivo binário - Prévia hex (primeiros 256 bytes):
ru: Бинарный файл — Hex-просмотр (первые 256 байт):
zh: 二进制文件 - Hex 预览（前 256 字节）：

source: Lines
de: Zeilen
es: Líneas
fr: Lignes
it: Linee
ja: 行
nl: Regels
pt: Linhas
ru: Строки
zh: 行数

source: Words
de: Wörter
es: Palabras
fr: Mots
it: Parole
ja: 単語
nl: Woorden
pt: Palavras
ru: Слова
zh: 词数

source: Characters
de: Zeichen
es: Caracteres
fr: Caractères
it: Caratteri
ja: 文字数
nl: Tekens
pt: Caracteres
ru: Символы
zh: 字符数

# charactersSuffix
source: characters
de: Zeichen
es: caracteres
fr: caractères
it: caratteri
ja: 文字
nl: tekens
pt: caracteres
ru: симв.
zh: 字符

# downloadInfo
source: Download functionality would be implemented here. In a production version the file would be downloaded or opened in an external viewer.
de: Download-Funktionalität würde hier implementiert werden. In einer Produktionsversion würde die Datei heruntergeladen oder in einem externen Viewer geöffnet.
es: La funcionalidad de descarga se implementaría aquí. En producción el archivo se descargaría o abriría externamente.
fr: La fonctionnalité de téléchargement serait implémentée ici. En production le fichier serait téléchargé ou ouvert dans un visualiseur externe.
it: La funzionalità di download verrebbe implementata qui. In produzione il file sarebbe scaricato o aperto esternamente.
ja: ダウンロード機能はここに実装されます。製品版ではファイルがダウンロードされるか、外部ビューアで開かれます。
nl: Downloadfunctionaliteit zou hier worden geïmplementeerd. In productie zou het bestand worden gedownload of extern geopend.
pt: A funcionalidade de download seria implementada aqui. Em produção o arquivo seria baixado ou aberto externamente.
ru: Функция загрузки будет реализована здесь. В продакшн-версии файл будет загружен или открыт во внешнем просмотрщике.
zh: 此处将实现下载功能。在正式版本中，文件将被下载或在外部查看器中打开。

# searchMultiHint
source: Search (partial words, multiple terms) ...
de: Suche (Teilwörter, mehrere Begriffe) ...
es: Buscar (palabras parciales, múltiples términos) ...
fr: Recherche (mots partiels, termes multiples) ...
it: Cerca (parole parziali, più termini) ...
ja: 検索 (部分一致・複数語対応)...
nl: Zoeken (deelwoorden, meerdere termen) ...
pt: Pesquisar (palavras parciais, múltiplos termos) ...
ru: Поиск (части слов, несколько терминов)...
zh: 搜索（部分匹配，多个关键字）...

source: Clear
de: Leeren
es: Limpiar
fr: Effacer
it: Pulisci
ja: クリア
nl: Wissen
pt: Limpar
ru: Очистить
zh: 清除

# changesRead
source: Changes (acknowledged)
de: Änderungen (gelesen)
es: Cambios (leídos)
fr: Modifications (lus)
it: Modifiche (lette)
ja: 変更 (既読)
nl: Wijzigingen (gelezen)
pt: Alterações (lidas)
ru: Изменения (прочитано)
zh: 更改（已读）

source: All files (flat)
de: Alle Dateien (flach)
es: Todos los archivos (plano)
fr: Tous les fichiers (plat)
it: Tutti i file (piatto)
ja: すべてのファイル (フラット)
nl: Alle bestanden (plat)
pt: Todos os arquivos (plano)
ru: Все файлы (списком)
zh: 所有文件（平面）

source: Toggle file types
de: Dateitypen ein/ausblenden
es: Alternar tipos de archivo
fr: Activer/désactiver types de fichiers
it: Attiva/disattiva tipi di file
ja: ファイルタイプを表示/非表示
nl: Bestandstypen schakelen
pt: Alternar tipos de arquivo
ru: Показать/скрыть типы файлов
zh: 显示/隐藏文件类型

# quickStepConfigureOpen
source: Open configure now
de: Jetzt konfigurieren öffnen
es: Abrir configurar ahora
fr: Ouvrir configurer maintenant
it: Apri configura ora
ja: 「今すぐ設定」を開く
nl: Nu configureren openen
pt: Abrir configurar agora
ru: Открыть «Настроить сейчас»
zh: 打开“立即配置”

# quickStepPasteLink
source: Paste GitHub link (e.g. https://github.com/OWNER/REPO)
de: GitHub Link einfügen (z.B. https://github.com/OWNER/REPO)
es: Pegar enlace GitHub (ej. https://github.com/OWNER/REPO)
fr: Coller le lien GitHub (ex. https://github.com/OWNER/REPO)
it: Incolla link GitHub (es. https://github.com/OWNER/REPO)
ja: GitHub リンクを貼り付け (例: https://github.com/OWNER/REPO)
nl: GitHub-link plakken (bv. https://github.com/OWNER/REPO)
pt: Colar link GitHub (ex. https://github.com/OWNER/REPO)
ru: Вставьте ссылку GitHub (например, https://github.com/OWNER/REPO)
zh: 粘贴 GitHub 链接（例如 https://github.com/OWNER/REPO）

# quickStepOptionalToken
source: Optionally set token (rate limit / private)
de: Optional Token setzen (Rate Limit / privat)
es: Opcional establecer token (límite / privado)
fr: Optionnellement définir un jeton (limite / privé)
it: Opzionale imposta token (limite / privato)
ja: オプションで Token を設定 (制限緩和 / プライベート用)
nl: Optioneel token instellen (limiet / privé)
pt: Opcional definir token (limite / privado)
ru: Необязательно: задать Token (для лимитов / приватных репо)
zh: 可选：设置 Token（提升限制或访问私有仓库）

# quickStepSaveStructure
source: Save – README structure loads
de: Speichern – README Struktur lädt
es: Guardar – estructura README carga
fr: Sauvegarder – structure README se charge
it: Salva – struttura README carica
ja: 保存 – README 構造を読み込みます
nl: Opslaan – README-structuur laadt
pt: Salvar – estrutura README carrega
ru: Сохранить — структура README загрузится
zh: 保存 - 加载 README 结构

# quickStepPasteLinkSearch
source: Paste link / search
de: Link einfügen / suchen
es: Pegar enlace / buscar
fr: Coller lien / rechercher
it: Incolla link / cerca
ja: リンクを貼り付け / 検索
nl: Link plakken / zoeken
pt: Colar link / pesquisar
ru: Вставить ссылку / поиск
zh: 粘贴链接 / 搜索

# quickStepSaveStructureShort
source: Save → structure
de: Speichern → Struktur
es: Guardar → estructura
fr: Sauvegarder → structure
it: Salva → struttura
ja: 保存 → 構造
nl: Opslaan → structuur
pt: Salvar → estrutura
ru: Сохранить → структура
zh: 保存 → 结构

source: Adjust filters
de: Filter anpassen
es: Ajustar filtros
fr: Ajuster les filtres
it: Regola filtri
ja: フィルターを調整
nl: Filters aanpassen
pt: Ajustar filtros
ru: Настроить фильтры
zh: 调整筛选器

# searchAllFilesHint
source: Search across all files...
de: In allen Dateien suchen...
es: Buscar en todos los archivos...
fr: Rechercher dans tous les fichiers...
it: Cerca in tutti i file...
ja: すべてのファイルを検索...
nl: Zoek in alle bestanden...
pt: Pesquisar em todos os arquivos...
ru: Поиск во всех файлах...
zh: 搜索所有文件...

# noResultsFor
source: No results for "{query}"
de: Keine Ergebnisse für "{query}"
es: Sin resultados para "{query}"
fr: Aucun résultat pour "{query}"
it: Nessun risultato per "{query}"
ja: "{query}" の結果はありません
nl: Geen resultaten voor "{query}"
pt: Nenhum resultado para "{query}"
ru: Нет результатов для "{query}"
zh: 未找到“{query}”的结果

# tryOtherSearch
source: Try different terms or adjust filters.
de: Andere Begriffe versuchen oder Filter anpassen.
es: Prueba otros términos o ajusta los filtros.
fr: Essayez d'autres termes ou ajustez les filtres.
it: Prova altri termini o regola i filtri.
ja: 別のキーワードやフィルターを試してください。
nl: Probeer andere termen of pas de filters aan.
pt: Tente outros termos ou ajuste os filtros.
ru: Попробуйте другие слова или измените фильтры.
zh: 尝试其他关键词或调整筛选条件。

# enterSearchTerm
source: Enter a search term
de: Suchbegriff eingeben
es: Introduce un término de búsqueda
fr: Saisissez un terme de recherche
it: Inserisci un termine di ricerca
ja: 検索語を入力
nl: Voer een zoekterm in
pt: Digite um termo de pesquisa
ru: Введите запрос для поиска
zh: 输入搜索词

# searchContentOrFilename
source: Search all files by content or filename.
de: Alle Dateien nach Inhalt oder Dateiname durchsuchen.
es: Busca en todos los archivos por contenido o nombre.
fr: Recherchez dans tous les fichiers par contenu ou nom.
it: Cerca in tutti i file per contenuto o nome.
ja: すべてのファイルの内容またはファイル名を検索します。
nl: Zoek in alle bestanden op inhoud of naam.
pt: Pesquise em todos os arquivos por conteúdo ou nome.
ru: Искать по содержимому и именам файлов.
zh: 搜索所有文件内容或文件名。

# searchFiltersTitle
source: Search filters
de: Suchfilter
es: Filtros de búsqueda
fr: Filtres de recherche
it: Filtri di ricerca
ja: 検索フィルター
nl: Zoekfilters
pt: Filtros de pesquisa
ru: Фильтры поиска
zh: 搜索筛选

# searchInContentTitle
source: Search in file content
de: In Dateiinhalt suchen
es: Buscar en contenido
fr: Rechercher dans le contenu
it: Cerca nel contenuto
ja: 内容内を検索
nl: Zoek in inhoud
pt: Pesquisar no conteúdo
ru: Поиск по содержимому
zh: 搜索文件内容

# searchInContentSubtitle
source: Searches the content of text files
de: Durchsucht den Inhalt von Textdateien
es: Examina el contenido de archivos de texto
fr: Parcourt le contenu des fichiers texte
it: Analizza il contenuto dei file di testo
ja: テキストファイルの内容を検索します
nl: Doorzoekt de inhoud van tekstbestanden
pt: Analisa o conteúdo de arquivos de texto
ru: Просматривает текстовые файлы
zh: 搜索文本文件内容

# searchInFilenameTitle
source: Search in filenames
de: In Dateinamen suchen
es: Buscar en nombres
fr: Rechercher dans les noms
it: Cerca nei nomi
ja: ファイル名で検索
nl: Zoek in bestandsnamen
pt: Pesquisar em nomes
ru: Поиск по имени файла
zh: 搜索文件名

# searchInFilenameSubtitle
source: Searches file and path names
de: Durchsucht Datei- und Pfadnamen
es: Examina nombres y rutas
fr: Parcourt noms de fichiers et chemins
it: Analizza nomi e percorsi
ja: ファイル名とパス名を検索します
nl: Doorzoekt namen en paden
pt: Analisa nomes e caminhos
ru: Просматривает имена файлов и пути
zh: 搜索文件和路径名称

# onlyTextFilesSubtitle
source: Excludes binary files
de: Schließt Binärdateien aus
es: Excluye archivos binarios
fr: Exclut les fichiers binaires
it: Esclude file binari
ja: バイナリファイルを除外します
nl: Sluit binaire bestanden uit
pt: Exclui arquivos binários
ru: Исключает бинарные файлы
zh: 排除二进制文件

source: Choose category
de: Kategorie wählen
es: Elegir categoría
fr: Choisir une catégorie
it: Scegli categoria
ja: カテゴリを選択
nl: Categorie kiezen
pt: Escolher categoria
ru: Выбрать категорию
zh: 选择分类

# filterReset
source: Reset filter
de: Filter zurücksetzen
es: Restablecer filtro
fr: Réinitialiser le filtre
it: Reimposta filtro
ja: フィルターをリセット
nl: Filter resetten
pt: Redefinir filtro
ru: Сброс фильтров
zh: 重置筛选

source: List view
de: Listenansicht
es: Vista de lista
fr: Vue liste
it: Vista elenco
ja: リスト表示
nl: Lijstweergave
pt: Vista de lista
ru: Список
zh: 列表视图

source: Group by category
de: Nach Kategorie gruppieren
es: Agrupar por categoría
fr: Grouper par catégorie
it: Raggruppa per categoria
ja: カテゴリ別にグループ化
nl: Groeperen op categorie
pt: Agrupar por categoria
ru: Группировать по категориям
zh: 按分类分组

source: Refresh
de: Aktualisieren
es: Actualizar
fr: Rafraîchir
it: Aggiorna
ja: 更新
nl: Vernieuwen
pt: Atualizar
ru: Обновить
zh: 刷新

source: Preview
de: Vorschau
es: Vista previa
fr: Aperçu
it: Anteprima
ja: プレビュー
nl: Voorbeeld
pt: Pré-visualizar
ru: Предпросмотр
zh: 预览

source: Open
de: Öffnen
es: Abrir
fr: Ouvrir
it: Apri
ja: 開く
nl: Openen
pt: Abrir
ru: Открыть
zh: 打开

# loadingFilesErrorTitle
source: Error loading files:
de: Fehler beim Laden der Dateien:
es: Error cargando archivos:
fr: Erreur de chargement des fichiers :
it: Errore nel caricamento file:
ja: ファイルの読み込みエラー:
nl: Fout bij laden van bestanden:
pt: Erro ao carregar arquivos:
ru: Ошибка загрузки файлов:
zh: 加载文件时出错：

# noFilesFoundFor
source: No files found for "{query}"
de: Keine Dateien gefunden für "{query}"
es: No se encontraron archivos para "{query}"
fr: Aucun fichier trouvé pour "{query}"
it: Nessun file trovato per "{query}"
ja: "{query}" に一致するファイルが見つかりません
nl: Geen bestanden gevonden voor "{query}"
pt: Nenhum arquivo encontrado para "{query}"
ru: Файлы для "{query}" не найдены
zh: 未找到与“{query}”匹配的文件

# noFilesInCategory
source: No files in this category
de: Keine Dateien in dieser Kategorie
es: No hay archivos en esta categoría
fr: Aucun fichier dans cette catégorie
it: Nessun file in questa categoria
ja: このカテゴリにはファイルがありません
nl: Geen bestanden in deze categorie
pt: Nenhum arquivo nesta categoria
ru: В этой категории нет файлов
zh: 此分类中无文件

source: Total
de: Gesamt
it: Totale
ja: 合計
nl: Totaal
ru: Всего
zh: 总计

# filesOfTotal
source: {filtered} of {total} files
de: {filtered} von {total} Dateien
es: {filtered} de {total} archivos
fr: {filtered} sur {total} fichiers
it: {filtered} di {total} file
ja: {filtered} / {total} ファイル
nl: {filtered} van {total} bestanden
pt: {filtered} de {total} arquivos
ru: {filtered} из {total} файлов
zh: {filtered} / {total} 个文件

source: No data
de: Keine Daten
es: Sin datos
fr: Aucune donnée
it: Nessun dato
ja: データなし
nl: Geen gegevens
pt: Sem dados
ru: Нет данных
zh: 无数据

# appTagline
source: Live GitHub Repo Documentation & File Viewer
de: Live GitHub Repo Dokumentation & Dateibetrachter
es: Visor y documentación de repos GitHub en vivo
fr: Documentation & visionneuse de dépôt GitHub en direct
it: Documentazione live & visualizzatore repo GitHub
ja: GitHub リポジトリのライブドキュメント＆ファイルビューア
nl: Live GitHub repo documentatie & bestandsviewer
pt: Visualizador & documentação de repositórios GitHub ao vivo
ru: Просмотр и документация GitHub-репозиториев в реальном времени
zh: GitHub 仓库文档与文件实时查看器

source: Author
de: Autor
es: Autor
fr: Auteur
it: Autore
ja: 作者
nl: Auteur
pt: Autor
ru: Автор
zh: 作者

source: Send E-mail
de: E-Mail senden
es: Enviar correo
fr: Envoyer un e-mail
it: Invia e-mail
ja: メールを送信
nl: E-mail sturen
pt: Enviar e-mail
ru: Отправить email
zh: 发送电子邮件

source: Note
de: Hinweis
es: Nota
fr: Remarque
it: Nota
ja: 注記
nl: Opmerking
pt: Nota
ru: Примечание
zh: 备注

# projectNote
source: This project loads content directly from GitHub. No telemetry / no third-party servers.
de: Dieses Projekt lädt Inhalte direkt aus GitHub. Keine Telemetrie / keine Drittanbieter-Server.
es: Este proyecto carga contenido directamente de GitHub. Sin telemetría ni servidores de terceros.
fr: Ce projet charge le contenu directement depuis GitHub. Pas de télémétrie ni serveurs tiers.
it: Questo progetto carica contenuti direttamente da GitHub. Nessuna telemetria o server di terze parti.
ja: このプロジェクトは GitHub から直接コンテンツを読み込みます。テレメトリーや外部サーバーは使用しません。
nl: Dit project laadt direct vanaf GitHub. Geen telemetry of derdenservers.
pt: Este projeto carrega conteúdo diretamente do GitHub. Sem telemetria ou servidores de terceiros.
ru: Проект загружает контент напрямую с GitHub. Без телеметрии и сторонних серверов.
zh: 此项目直接从 GitHub 加载内容。无遥测，无第三方服务器。

source: License
de: Lizenz
es: Licencia
fr: Licence
it: Licenza
ja: ライセンス
nl: Licentie
pt: Licença
ru: Лицензия
zh: 许可证

# licenseText
source: Restricted internal use (see README license section).
de: Eingeschränkte interne Nutzung (siehe README Lizenzabschnitt).
es: Uso interno restringido (ver sección de licencia en README).
fr: Usage interne restreint (voir README).
it: Uso interno ristretto (vedi README).
ja: 内部利用に限定 (README のライセンス項を参照)。
nl: Beperkt intern gebruik (zie README).
pt: Uso interno restrito (ver README).
ru: Ограниченное внутреннее использование (см. раздел лицензии README).
zh: 仅限内部使用（详见 README 的许可证部分）。

source: Version
es: Versión
it: Versione
ja: バージョン
nl: Versie
pt: Versão
ru: Версия
zh: 版本

# manualVersion
source: 1.0.0 (manually maintained)
de: 1.0.0 (manuell gepflegt)
es: 1.0.0 (mantenido manualmente)
fr: 1.0.0 (maintenu manuellement)
it: 1.0.0 (manutenuto manualmente)
ja: 1.0.0 (手動管理)
nl: 1.0.0 (handmatig onderhouden)
pt: 1.0.0 (mantido manualmente)
ru: 1.0.0 (ручное управление)
zh: 1.0.0（手动维护）

# categoryLabel
source: Category
de: Kategorie
es: Categoría
fr: Catégorie
it: Categoria
ja: カテゴリ
nl: Categorie
pt: Categoria
ru: Категория
zh: 分类

source: Current selection
de: Aktuelle Auswahl
es: Selección actual
fr: Sélection actuelle
it: Selezione corrente
ja: 現在の選択
nl: Huidige selectie
pt: Seleção atual
ru: Текущий выбор
zh: 当前选择

# noValidLinkYet
source: No valid link detected yet.
de: Noch kein gültiger Link erkannt.
es: Aún no se detectó un enlace válido.
fr: Aucun lien valide détecté pour l'instant.
it: Nessun link valido ancora rilevato.
ja: 有効なリンクがまだ認識されていません。
nl: Nog geen geldige link gedetecteerd.
pt: Ainda nenhum link válido detectado.
ru: Пока нет действительной ссылки.
zh: 尚未识别到有效链接。

source: without token
de: ohne Token
es: sin token
fr: sans jeton
it: senza token
ja: Token なし
nl: zonder token
pt: sem token
ru: без Token
zh: 无 Token

source: Token active
de: Token aktiv
es: Token activo
fr: Jeton actif
it: Token attivo
ja: Token 有効
nl: Token actief
pt: Token ativo
ru: Token активен
zh: Token 已启用

source: Add token
de: Token hinzufügen
es: Agregar token
fr: Ajouter un jeton
it: Aggiungi token
ja: Token を追加
nl: Token toevoegen
pt: Adicionar token
ru: Добавить Token
zh: 添加 Token

source: Manage token
de: Token verwalten
es: Gestionar token
fr: Gérer le jeton
it: Gestisci token
ja: Token を管理
nl: Token beheren
pt: Gerir token
ru: Управление Token
zh: 管理 Token

# stepRepositorySelectTitle
source: 1 · Select repository
de: 1 · Repository wählen
es: 1 · Seleccionar repositorio
fr: 1 · Sélectionner le dépôt
it: 1 · Seleziona repository
ja: 1 · Repository を選択
nl: 1 · Repository kiezen
pt: 1 · Selecionar repositório
ru: 1 · Выбор Repository
zh: 1 · 选择 Repository

source: GitHub link
es: Enlace GitHub
fr: Lien GitHub
it: Link GitHub
ja: GitHub リンク
pt: Link GitHub
ru: Ссылка GitHub
zh: GitHub 链接

# pasteOrSearchRepo
source: Tip: Simply paste repo URL or search above.
de: Tipp: Einfach Repo URL einfügen oder oben suchen.
es: Consejo: Simplemente pega la URL del repo o busca arriba.
fr: Astuce : collez simplement l'URL du dépôt ou cherchez ci‑dessus.
it: Suggerimento: incolla semplicemente l'URL del repo o cerca sopra.
ja: ヒント: リポジトリ URL を貼り付けるか、上部で検索します。
nl: Tip: plak gewoon de repo‑URL of zoek hierboven.
pt: Dica: basta colar a URL do repositório ou pesquisar acima.
ru: Совет: вставьте URL репозитория или воспользуйтесь поиском выше.
zh: 提示：粘贴仓库 URL 或在上方搜索。

# stepOptionalDirectory
source: 2 · Optional directory (root if empty)
de: 2 · Optionaler Ordner (Root wenn leer)
es: 2 · Directorio opcional (root si vacío)
fr: 2 · Dossier optionnel (racine si vide)
it: 2 · Directory opzionale (root se vuota)
ja: 2 · 任意のフォルダ (空ならルート)
nl: 2 · Optionele map (root indien leeg)
pt: 2 · Diretório opcional (root se vazio)
ru: 2 · Необязательная папка (корень, если пусто)
zh: 2 · 可选目录（留空为根目录）

# chooseRepositoryFirst
source: First select or search a repository.
de: Erst ein Repository wählen oder suchen.
es: Primero selecciona o busca un repositorio.
fr: Choisissez ou cherchez d'abord un dépôt.
it: Seleziona o cerca prima un repository.
ja: 先に Repository を選択または検索してください。
nl: Kies of zoek eerst een repository.
pt: Primeiro selecione ou pesquise um repositório.
ru: Сначала выберите или найдите Repository.
zh: 请先选择或搜索 Repository。

source: Suggestions
de: Vorschläge
es: Sugerencias
it: Suggerimenti
ja: 候補
nl: Suggesties
pt: Sugestões
ru: Предложения
zh: 建议

source: Rescan
de: Neu scannen
es: Reexplorar
fr: Rescanner
it: Riscansiona
ja: 再スキャン
nl: Opnieuw scannen
pt: Reanalisar
ru: Повторное сканирование
zh: 重新扫描

# errorPrefix
source: Error:
de: Fehler:
fr: Erreur:
it: Errore:
ja: エラー:
nl: Fout:
pt: Erro:
ru: Ошибка:
zh: 错误：

# selectionLabel
source: Selection: {dir}
de: Auswahl: {dir}
es: Selección: {dir}
fr: Sélection : {dir}
it: Selezione: {dir}
ja: 選択: {dir}
nl: Selectie: {dir}
pt: Seleção: {dir}
ru: Выбор: {dir}
zh: 选择：{dir}

source: Show all directories
de: Alle Verzeichnisse anzeigen
es: Mostrar todos los directorios
fr: Afficher tous les dossiers
it: Mostra tutte le directory
ja: すべてのディレクトリを表示
nl: Alle mappen tonen
pt: Mostrar todos os diretórios
ru: Показать все директории
zh: 显示所有目录

# noDataYetScanOrAdopt
source: No data yet (scan or adopt repository).
de: Noch keine Daten (scanne oder Repository übernehmen).
es: Sin datos aún (explora o adopta repositorio).
fr: Pas encore de données (scanner ou adopter le dépôt).
it: Ancora nessun dato (scansiona o adotta il repository).
ja: まだデータがありません（スキャンまたは Repository を採用）。
nl: Nog geen data (scan of neem repository over).
pt: Ainda sem dados (analise ou adote o repositório).
ru: Пока нет данных (выполните сканирование или примите Repository).
zh: 暂无数据（请扫描或导入仓库）。

source: All directories
de: Alle Verzeichnisse
es: Todos los directorios
fr: Tous les dossiers
it: Tutte le directory
ja: すべてのディレクトリ
nl: Alle mappen
pt: Todos os diretórios
ru: Все директории
zh: 所有目录

# tokenOptionalHigherLimits
source: Token (optional for higher rate limits)
de: Token (optional für höhere Rate Limits)
es: Token (opcional para límites más altos)
fr: Jeton (optionnel pour limites plus élevées)
it: Token (opzionale per limiti più alti)
ja: Token (任意、上限引き上げ用)
nl: Token (optioneel voor hogere limieten)
pt: Token (opcional para limites maiores)
ru: Token (необязательно для увеличения лимитов)
zh: Token（可选，用于提升限制）

source: Why token?
de: Warum Token?
es: ¿Por qué token?
fr: Pourquoi un jeton ?
it: Perché token?
ja: なぜ Token が必要？
nl: Waarom token?
pt: Por que token?
ru: Зачем нужен Token?
zh: 为什么需要 Token？

source: Token help
de: Token Hilfe
es: Ayuda token
fr: Aide jeton
it: Aiuto token
ja: Token ヘルプ
nl: Token hulp
pt: Ajuda token
ru: Помощь по Token
zh: Token 帮助

source: Device login (code)
es: Inicio dispositivo (código)
fr: Connexion appareil (code)
it: Login dispositivo (codice)
ja: デバイスログイン (コード)
nl: Apparaat login (code)
pt: Login dispositivo (código)
ru: Код входа через устройство
zh: 设备登录（代码）

source: In-app login
es: Inicio en la app
fr: Connexion in‑app
it: Login in‑app
ja: アプリ内ログイン
pt: Login in‑app
ru: Вход в приложении
zh: 应用内登录

source: Check
de: Prüfen
es: Comprobar
fr: Vérifier
it: Verifica
ja: 確認
nl: Controleren
pt: Verificar
ru: Проверить
zh: 检查

source: Delete token
de: Token löschen
es: Eliminar token
fr: Supprimer le jeton
it: Elimina token
ja: Token を削除
nl: Token verwijderen
pt: Excluir token
ru: Удалить Token
zh: 删除 Token

source: GitHub token help
de: GitHub Token Hilfe
es: Ayuda token GitHub
fr: Aide jeton GitHub
it: Aiuto token GitHub
ja: GitHub Token ヘルプ
nl: GitHub token hulp
pt: Ajuda token GitHub
ru: Помощь по GitHub Token
zh: GitHub Token 帮助

# whyPersonalAccessToken
source: Why a Personal Access Token (PAT)?
de: Warum ein Personal Access Token (PAT)?
es: ¿Por qué un Personal Access Token (PAT)?
fr: Pourquoi un Personal Access Token (PAT) ?
it: Perché un Personal Access Token (PAT)?
ja: なぜ Personal Access Token (PAT)？
nl: Waarom een Personal Access Token (PAT)?
pt: Por que um Personal Access Token (PAT)?
ru: Зачем Personal Access Token (PAT)?
zh: 为什么需要 Personal Access Token（PAT）？
