Repository: mindoroevo/RepoReader
Catalog: lib/l10n/app_*.arb
Languages: de, es, fr, it, ja, nl, pt, ru, zh

# tipSetupDirBody
source: Select the start directory (default is docs).
de: Wähle das Startverzeichnis (Standard: docs).
es: Selecciona el directorio inicial (por defecto docs).
fr: Sélectionnez répertoire de départ (par défaut docs).
it: Seleziona directory iniziale (predefinito docs).
ja: 開始ディレクトリを選択 (デフォルト: docs)。
ru: Выберите начальную директорию (по умолчанию: docs).
zh: 选择起始目录（默认：docs）。

# tipSetupApplyTitle
source: Apply
de: Übernehmen
es: Aplicar
fr: Appliquer
it: Applica
ja: 適用
ru: Применить
zh: 应用

# tipSetupApplyBody
source: Save and load files from the selected repository.
de: Speichern und Dateien aus dem gewählten Repository laden.
es: Guardar y cargar archivos del repositorio seleccionado.
fr: Sauvegarder et charger fichiers du dépôt sélectionné.
it: Salva e carica file dal repository selezionato.
ja: 保存して選択した Repository からファイルを読み込みます。
ru: Сохраните и загрузите файлы из выбранного Repository.
zh: 保存并从所选 Repository 加载文件。

# tipSetupTokenTitle
source: Optional token
de: Optionales Token
es: Token opcional
fr: Jeton optionnel
it: Token opzionale
ja: オプション Token
ru: Необязательный Token
zh: 可选 Token

# tipSetupTokenBody
source: Add a GitHub token for higher rate limits or private repos.
de: Für höhere Limits oder private Repos ein GitHub‑Token hinterlegen.
es: Agrega un token de GitHub para límites superiores o repos privados.
fr: Ajoutez un jeton GitHub pour limites supérieures ou dépôts privés.
it: Aggiungi token GitHub per limiti superiori o repo privati.
ja: 上限緩和やプライベート Repo 用に GitHub Token を設定します。
ru: Укажите Token для повышения лимита или доступа к приватным Repo.
zh: 设置 Token 以提高限制或访问私有 Repo。

# tipPageTtsTitle
source: Text-to-Speech
de: Vorlesen (TTS)
es: Texto a voz
fr: Synthèse vocale
it: Testo in voce
ja: 読み上げ (TTS)
ru: Озвучивание (TTS)
zh: 朗读（TTS）

# tipPageTtsBody
source: Have the current page read aloud with voice options.
de: Die Seite mit Stimme vorlesen lassen – Sprache/Tempo anpassen.
es: Lee la página en voz alta con opciones de voz.
fr: Faites lire la page à voix haute avec options vocales.
it: Fai leggere la pagina ad alta voce con opzioni vocali.
ja: ページを音声で読み上げます – 言語 / 速度を調整可能。
ru: Прослушайте страницу вслух — настройте язык и скорость.
zh: 用语音朗读页面 – 可调整语言和语速。

# tipPageTocTitle
source: Table of contents
de: Inhaltsverzeichnis
es: Tabla de contenidos
fr: Table des matières
it: Sommario
ja: 目次
ru: Оглавление
zh: 目录

# tipPageTocBody
source: Jump to sections detected in the document.
de: Zu Abschnitten im Dokument springen.
es: Saltar a secciones detectadas en el documento.
fr: Sauter aux sections détectées dans le document.
it: Salta alle sezioni rilevate nel documento.
ja: ドキュメント内のセクションへ移動。
ru: Переходите к разделам документа.
zh: 跳转到文档中的各部分。

source: Tutorial
fr: Tutoriel
ja: チュートリアル
ru: Руководство
zh: 教程

# onbSkip
source: Skip
de: Überspringen
es: Omitir
fr: Ignorer
it: Salta
ja: スキップ
ru: Пропустить
zh: 跳过

# onbNext
source: Next
de: Weiter
es: Siguiente
fr: Suivant
it: Avanti
ja: 次へ
ru: Далее
zh: 下一步

# onbDone
source: Done
de: Fertig
es: Hecho
fr: Terminé
it: Fatto
ja: 完了
ru: Готово
zh: 完成

# onbWelcomeTitle
source: Welcome to RepoReader
de: Willkommen bei RepoReader
es: Bienvenido a RepoReader
fr: Bienvenue dans RepoReader
it: Benvenuto in RepoReader
ja: RepoReader へようこそ
ru: Добро пожаловать в RepoReader
zh: 欢迎使用 RepoReader

# onbWelcomeBody
source: Browse and read documentation directly from GitHub repositories. Configure a source once, then navigate, search, favorite, and even use offline snapshots.
de: Lies Dokumentation direkt aus GitHub-Repositories. Einmal Quelle konfigurieren, dann navigieren, suchen, favorisieren und sogar offline nutzen.
es: Explora y lee documentación directamente desde repositorios de GitHub. Configura una fuente una vez, luego navega, busca, favoritos y usa incluso sin conexión.
fr: Parcourez et lisez la documentation directement depuis les dépôts GitHub. Configurez une source une fois, puis naviguez, cherchez, mettez en favoris et utilisez même hors ligne.
it: Sfoglia e leggi documentazione direttamente da repository GitHub. Configura una fonte una volta, poi naviga, cerca, aggiungi ai preferiti e usa anche offline.
ja: GitHub Repository から直接ドキュメントを読み込みます。一度ソースを設定すれば、ナビゲーション、検索、お気に入り、オフライン利用が可能です。
ru: Читайте документацию напрямую из GitHub Repository. Один раз настройте источник и используйте поиск, избранное и оффлайн-доступ.
zh: 直接从 GitHub 仓库阅读文档。配置一次来源后即可浏览、搜索、收藏并支持离线模式。

# onbSetupTitle
source: Configure your source
de: Quelle einrichten
es: Configurar fuente
fr: Configurer votre source
it: Configura la tua fonte
ja: ソース設定
ru: Настройка источника
zh: 配置来源

# onbSetupBody
source: Paste a GitHub link or search a repository. We auto-detect owner, repo, branch and docs directory. Optionally add a token for private repos or higher limits.
de: Füge einen GitHub-Link ein oder suche ein Repository. Owner, Repo, Branch und Docs-Ordner erkennen wir automatisch. Optional Token für private Repos oder höhere Limits.
es: Pega un enlace de GitHub o busca un repositorio. Detectamos automáticamente owner, repo, branch y directorio docs. Opcionalmente agrega un token para repos privados o límites superiores.
fr: Collez un lien GitHub ou cherchez un dépôt. Nous détectons automatiquement propriétaire, dépôt, branche et répertoire docs. Optionnellement ajoutez un jeton pour dépôts privés ou limites supérieures.
it: Incolla un link GitHub o cerca un repository. Rileviamo automaticamente proprietario, repo, branch e directory docs. Opzionalmente aggiungi un token per repo privati o limiti superiori.
ja: GitHub リンクを貼り付けるか Repository を検索します。Owner、Repo、Branch、Docs フォルダを自動認識します。オプションで Token を設定できます。
ru: Вставьте ссылку GitHub или найдите Repository. Owner, Repo, Branch и папка Docs определяются автоматически. При необходимости добавьте Token.
zh: 粘贴 GitHub 链接或搜索 Repository。我们会自动识别 Owner、Repo、Branch 和 Docs 文件夹，可选设置 Token。

# onbReadTitle
source: Navigate & Read
de: Navigieren & Lesen
es: Navegar & Leer
fr: Naviguer & Lire
it: Naviga & Leggi
ja: ナビゲートと閲覧
ru: Навигация и чтение
zh: 导航与阅读

# onbReadBody
source: Open Markdown files with rich rendering. Internal links work, and you can star favorites for quick access.
de: Markdown-Dateien mit schöner Darstellung öffnen. Interne Links funktionieren; markiere Favoriten für schnellen Zugriff.
es: Abre archivos Markdown con renderizado rico. Los enlaces internos funcionan; marca favoritos para acceso rápido.
fr: Ouvrez les fichiers Markdown avec rendu riche. Les liens internes fonctionnent ; marquez les favoris pour accès rapide.
it: Apri file Markdown con rendering ricco. I link interni funzionano; aggiungi stelle ai preferiti per accesso rapido.
ja: Markdown ファイルを美しく表示。内部リンクに対応し、お気に入り登録も可能です。
ru: Открывайте Markdown-файлы с удобным форматированием. Внутренние ссылки работают; можно добавлять в избранное.
zh: 以优雅的方式打开 Markdown 文件。支持内部链接，可添加收藏。

# onbSearchTitle
source: Search & File Browser
de: Suche & Dateibrowser
es: Búsqueda & Explorador de archivos
fr: Recherche & Explorateur de fichiers
it: Ricerca & Browser file
ja: 検索とファイルブラウザ
ru: Поиск и проводник
zh: 搜索与文件浏览

# onbSearchBody
source: Find content across files and paths. Use the file browser to open PDFs, images, scripts and more.
de: Finde Inhalte über Dateien und Pfade. Mit dem Dateibrowser öffnest du PDFs, Bilder, Skripte und mehr.
es: Encuentra contenido en archivos y rutas. Usa el explorador de archivos para abrir PDFs, imágenes, scripts y más.
fr: Trouvez du contenu dans fichiers et chemins. Utilisez l'explorateur pour ouvrir PDFs, images, scripts et plus.
it: Trova contenuti in file e percorsi. Usa il browser file per aprire PDF, immagini, script e altro.
ja: ファイルとパスを検索。ファイルブラウザで PDF、画像、スクリプトなどを開けます。
ru: Находите контент по файлам и путям. Через проводник открывайте PDF, изображения, скрипты и другое.
zh: 按文件和路径查找内容。通过浏览器可打开 PDF、图片、脚本等。

# onbExtrasTitle
source: Changes, Offline & More
de: Änderungen, Offline & mehr
es: Cambios, Offline & Más
fr: Changements, Hors ligne & Plus
it: Modifiche, Offline & Altro
ja: 変更通知、オフラインなど
ru: Изменения, оффлайн и другое
zh: 更改、离线与更多功能

# onbExtrasBody
source: Get notified about changes, create an offline snapshot to read without internet, and customize file types shown.
de: Benachrichtigungen bei Änderungen, Offline-Snapshot zum Lesen ohne Internet und anpassbare Dateitypen.
es: Notificaciones sobre cambios, crea snapshot offline para leer sin internet y personaliza tipos de archivos mostrados.
fr: Notifications de changements, créez un snapshot hors ligne pour lire sans internet et personnalisez les types de fichiers affichés.
it: Notifiche di modifiche, crea snapshot offline per leggere senza internet e personalizza tipi di file mostrati.
ja: 変更通知、オフラインスナップショット、ファイルタイプ設定などが利用可能です。
ru: Уведомления об изменениях, оффлайн-снимки для чтения без интернета и настройка типов файлов.
zh: 支持更改通知、离线快照阅读和文件类型自定义。

source: Repository
es: Repositorio
fr: Dépôt
pt: Repositório

source: Branch
es: Rama
fr: Branche
it: Ramo

# branchLabel
source: Branch: {branch}
es: Rama: {branch}
fr: Branche: {branch}

source: Token
fr: Jeton
