Repository: mindoroevo/RepoReader
Catalog: lib/l10n/app_*.arb
Languages: de, es, fr, it, ja, nl, pt, ru, zh

# aboutProject
source: About this Project
de: Über dieses Projekt
es: Acerca de este proyecto
fr: À propos de ce projet
it: Informazioni su questo progetto
ja: このプロジェクトについて
nl: Over dit project
pt: Sobre este projeto
ru: О проекте
zh: 关于此项目

source: Settings
de: Einstellungen
es: Configuración
fr: Paramètres
it: Impostazioni
ja: 設定
nl: Instellingen
pt: Configurações
ru: Настройки
zh: 设置

source: Search
de: Suche
es: Búsqueda
fr: Recherche
it: Cerca
ja: 検索
nl: Zoeken
pt: Pesquisar
ru: Поиск
zh: 搜索

source: Enhanced Search
de: Erweiterte Suche
es: Búsqueda avanzada
fr: Recherche avancée
it: Ricerca avanzata
ja: 拡張検索
nl: Geavanceerd zoeken
pt: Pesquisa avançada
ru: Расширенный поиск
zh: 高级搜索

# allInOne
source: All – from top to bottom
de: Alles – von oben nach unten
es: Todo – de arriba hacia abajo
fr: Tout – du haut vers le bas
it: Tutto – dall'alto verso il basso
ja: すべて（上から下まで）
nl: Alles – van boven naar beneden
pt: Tudo – de cima para baixo
ru: Все — сверху вниз
zh: 全部（从上到下）

source: Change Source
de: Quelle ändern
es: Cambiar fuente
fr: Changer la source
it: Cambia sorgente
ja: ソースを変更
nl: Bron wijzigen
pt: Alterar fonte
ru: Изменить источник
zh: 更改来源

source: GitHub Login
de: GitHub Anmeldung
es: Inicio de sesión GitHub
fr: Connexion GitHub
it: Accesso GitHub
ja: GitHub ログイン
nl: GitHub inloggen
pt: Login do GitHub
ru: Вход через GitHub
zh: GitHub 登录

# noMailClientFound
source: No mail client found – address copied.
de: Kein Mail‑Client gefunden – Adresse kopiert.
es: No se encontró cliente de correo – dirección copiada.
fr: Aucun client de messagerie trouvé – adresse copiée.
it: Nessun client di posta trovato – indirizzo copiato.
ja: メールクライアントが見つかりません。アドレスをコピーしました。
nl: Geen e-mailclient gevonden – adres gekopieerd.
pt: Nenhum cliente de email encontrado – endereço copiado.
ru: Почтовый клиент не найден — адрес скопирован.
zh: 未找到邮件客户端，地址已复制。

source: Copy to clipboard
de: In Zwischenablage kopieren
es: Copiar al portapapeles
fr: Copier dans le presse-papiers
it: Copia negli appunti
ja: クリップボードにコピー
nl: Kopiëren naar klembord
pt: Copiar para a área de transferência
ru: Копировать в буфер обмена
zh: 复制到剪贴板

source: Open in new window
de: In neuem Fenster öffnen
es: Abrir en nueva ventana
fr: Ouvrir dans une nouvelle fenêtre
it: Apri in nuova finestra
ja: 新しいウィンドウで開く
nl: Openen in nieuw venster
pt: Abrir em nova janela
ru: Открыть в новом окне
zh: 在新窗口中打开

# largeFileWarning
source: Large file ({size} characters) - performance may be affected
de: Große Datei ({size} Zeichen) - Performance kann beeinträchtigt sein
es: Archivo grande ({size} caracteres) - el rendimiento puede verse afectado
fr: Fichier volumineux ({size} caractères) - les performances peuvent être affectées
it: File grande ({size} caratteri) - le prestazioni potrebbero essere compromesse
ja: 大きなファイル ({size} 文字) – パフォーマンスに影響する可能性があります
nl: Groot bestand ({size} tekens) - prestaties kunnen worden beïnvloed
pt: Arquivo grande ({size} caracteres) - o desempenho pode ser afetado
ru: Большой файл ({size} символов) — производительность может снизиться
zh: 大型文件 ({size} 字符) - 可能影响性能

source: Image could not be loaded
de: Bild konnte nicht geladen werden
es: No se pudo cargar la imagen
fr: L'image n'a pas pu être chargée
it: Impossibile caricare l'immagine
ja: 画像を読み込めませんでした
nl: Afbeelding kon niet worden geladen
pt: Não foi possível carregar a imagem
ru: Не удалось загрузить изображение
zh: 无法加载图片

# base64Data
source: Base64 data ({size} bytes)
de: Base64 Daten ({size} Bytes)
es: Datos Base64 ({size} bytes)
fr: Données Base64 ({size} octets)
it: Dati Base64 ({size} byte)
ja: Base64 データ ({size} バイト)
nl: Base64 gegevens ({size} bytes)
pt: Dados Base64 ({size} bytes)
ru: Данные Base64 ({size} байт)
zh: Base64 数据 ({size} 字节)

source: PDF document
de: PDF-Dokument
es: Documento PDF
fr: Document PDF
it: Documento PDF
ja: PDF ドキュメント
pt: Documento PDF
ru: PDF-документ
zh: PDF 文档

source: No additional file types found.
de: Keine zusätzlichen Dateitypen gefunden.
es: No se encontraron tipos de archivo adicionales.
fr: Aucun type de fichier supplémentaire trouvé.
it: Nessun tipo di file aggiuntivo trovato.
ja: 追加のファイルタイプは見つかりませんでした。
nl: Geen aanvullende bestandstypes gevonden.
pt: Nenhum tipo de arquivo adicional encontrado.
ru: Дополнительные типы файлов не найдены.
zh: 未找到其他文件类型。

# onlyReadmeVisible
source: Only README.md visible
de: Nur README.md sichtbar
es: Solo README.md visible
fr: Seul README.md visible
it: Solo README.md visibile
ja: README.md のみ表示
nl: Alleen README.md zichtbaar
pt: Apenas README.md visível
ru: Отображается только README.md
zh: 仅显示 README.md

# filterExtension
source: Filter extension (e.g. png)
de: Extension filtern (z.B. png)
es: Filtrar extensión (ej. png)
fr: Filtrer l'extension (ex. png)
it: Filtra estensione (es. png)
ja: 拡張子でフィルター (例: png)
nl: Extensie filteren (bijv. png)
pt: Filtrar extensão (ex. png)
ru: Фильтр по расширению (например, png)
zh: 按扩展名筛选（例如 png）

source: No snapshot
de: Kein Snapshot
es: Sin instantánea
fr: Aucun instantané
it: Nessuna istantanea
ja: スナップショットなし
nl: Geen momentopname
pt: Nenhum instantâneo
ru: Нет снимка (snapshot)
zh: 无快照

source: Not found
de: Nicht gefunden
es: No encontrado
fr: Non trouvé
it: Non trovato
ja: 見つかりません
nl: Niet gevonden
pt: Não encontrado
ru: Не найдено
zh: 未找到

source: Loading...
de: Lädt...
es: Cargando...
fr: Chargement...
it: Caricamento...
ja: 読み込み中...
nl: Laden...
pt: Carregando...
ru: Загрузка...
zh: 加载中...

source: Error
de: Fehler
fr: Erreur
it: Errore
ja: エラー
nl: Fout
pt: Erro
ru: Ошибка
zh: 错误

source: Retry
de: Wiederholen
es: Reintentar
fr: Réessayer
it: Riprova
ja: 再試行
nl: Opnieuw proberen
pt: Tentar novamente
ru: Повторить
zh: 重试

source: Cancel
de: Abbrechen
es: Cancelar
fr: Annuler
it: Annulla
ja: キャンセル
nl: Annuleren
pt: Cancelar
ru: Отмена
zh: 取消

source: OK
ru: ОК
zh: 确定

source: Close
de: Schließen
es: Cerrar
fr: Fermer
it: Chiudi
ja: 閉じる
nl: Sluiten
pt: Fechar
ru: Закрыть
zh: 关闭

source: Save
de: Speichern
es: Guardar
fr: Sauvegarder
it: Salva
ja: 保存
nl: Opslaan
pt: Salvar
ru: Сохранить
zh: 保存

source: Home
de: Startseite
es: Inicio
fr: Accueil
ja: ホーム
nl: Thuis
pt: Início
ru: Главная
zh: 首页

source: Favorites
de: Favoriten
es: Favoritos
fr: Favoris
it: Preferiti
ja: お気に入り
nl: Favorieten
pt: Favoritos
ru: Избранное
zh: 收藏夹

source: Theme
de: Design
es: Tema
fr: Thème
it: Tema
ja: テーマ
nl: Thema
pt: Tema
ru: Тема
zh: 主题

source: Light
de: Hell
es: Claro
fr: Clair
it: Chiaro
ja: ライト
nl: Licht
pt: Claro
ru: Светлая
zh: 浅色

source: Dark
de: Dunkel
es: Oscuro
fr: Sombre
it: Scuro
ja: ダーク
nl: Donker
pt: Escuro
ru: Тёмная
zh: 深色

source: System
es: Sistema
fr: Système
it: Sistema
ja: システム
nl: Systeem
pt: Sistema
ru: Системная
zh: 系统

source: Changes
de: Änderungen
es: Cambios
fr: Modifications
it: Modifiche
ja: 変更
nl: Wijzigingen
pt: Alterações
ru: Изменения
zh: 更改

source: No changes
de: Keine Änderungen
es: Sin cambios
fr: Aucune modification
it: Nessuna modifica
ja: 変更なし
nl: Geen wijzigingen
pt: Sem alterações
ru: Нет изменений
zh: 无更改

source: Offline
es: Sin conexión
fr: Hors ligne
ja: オフライン
ru: Оффлайн
zh: 离线

source: Online
es: En línea
fr: En ligne
ja: オンライン
ru: Онлайн
zh: 在线

source: Categories
de: Kategorien
es: Categorías
fr: Catégories
it: Categorie
ja: カテゴリ
nl: Categorieën
pt: Categorias
ru: Категории
zh: 分类

source: File Browser
de: Dateibrowser
es: Explorador de archivos
fr: Explorateur de fichiers
it: Esplora file
ja: ファイルブラウザ
nl: Bestandsbrowser
pt: Navegador de arquivos
ru: Файловый браузер
zh: 文件浏览器

source: Search files
de: Dateien durchsuchen
es: Buscar archivos
fr: Rechercher des fichiers
it: Cerca file
ja: ファイルを検索
nl: Bestanden zoeken
pt: Pesquisar arquivos
ru: Поиск файлов
zh: 搜索文件

source: Text only
de: Nur Text
es: Solo texto
fr: Texte seulement
it: Solo testo
ja: テキストのみ
nl: Alleen tekst
pt: Apenas texto
ru: Только текст
zh: 仅文本

source: Show categories
de: Kategorien anzeigen
es: Mostrar categorías
fr: Afficher les catégories
it: Mostra categorie
ja: カテゴリを表示
nl: Categorieën tonen
pt: Mostrar categorias
ru: Показать категории
zh: 显示分类

source: Flat list
de: Flache Liste
es: Lista plana
fr: Liste plate
it: Lista piatta
ja: フラットリスト
nl: Platte lijst
pt: Lista plana
ru: Плоский список
zh: 扁平列表

source: Menu
de: Menü
es: Menú
ja: メニュー
ru: Меню
zh: 菜单

source: Search Markdown files
de: Markdown-Dateien durchsuchen
es: Buscar archivos Markdown
fr: Rechercher des fichiers Markdown
it: Cerca file Markdown
ja: Markdown ファイルを検索
nl: Zoek Markdown bestanden
pt: Pesquisar arquivos Markdown
ru: Поиск по Markdown-файлам
zh: 搜索 Markdown 文件

source: All Files
de: Alle Dateien
es: Todos los archivos
fr: Tous les fichiers
it: Tutti i file
ja: すべてのファイル
nl: Alle bestanden
pt: Todos os arquivos
ru: Все файлы
zh: 所有文件

# pdfScriptsImages
source: PDFs, Scripts, Images, etc.
de: PDFs, Skripte, Bilder, etc.
es: PDFs, Scripts, Imágenes, etc.
it: PDF, Script, Immagini, ecc.
ja: PDF、スクリプト、画像など
nl: PDFs, Scripts, Afbeeldingen, enz.
pt: PDFs, Scripts, Imagens, etc.
ru: PDF, скрипты, изображения и т.д.
zh: PDF、脚本、图片等

source: Author & Project info
de: Author & Projektinfo
es: Autor & Info del proyecto
fr: Auteur & Info projet
it: Autore & Info progetto
ja: 作者・プロジェクト情報
nl: Auteur & Projectinfo
pt: Autor & Info do projeto
ru: Автор и информация о проекте
zh: 作者与项目信息

source: About
de: Über
es: Acerca de
fr: À propos
it: Info
ja: 概要
nl: Over
pt: Sobre
ru: О программе
zh: 关于

# noReadmeFound
source: No README files found
de: Keine README-Dateien gefunden
es: No se encontraron archivos README
fr: Aucun fichier README trouvé
it: Nessun file README trovato
ja: README ファイルが見つかりません
nl: Geen README bestanden gevonden
pt: Nenhum arquivo README encontrado
ru: README-файл не найден
zh: 未找到 README 文件

source: Pull to refresh
de: Zum Aktualisieren ziehen
es: Deslizar para actualizar
fr: Tirer pour actualiser
it: Trascina per aggiornare
ja: 引っ張って更新
nl: Trek om te vernieuwen
pt: Puxar para atualizar
ru: Потяните, чтобы обновить
zh: 下拉刷新

source: Network error
de: Netzwerkfehler
es: Error de red
fr: Erreur réseau
it: Errore di rete
ja: ネットワークエラー
nl: Netwerkfout
pt: Erro de rede
ru: Ошибка сети
zh: 网络错误

source: Refreshing...
de: Aktualisiert...
es: Actualizando...
fr: Actualisation...
it: Aggiornamento...
ja: 更新中...
nl: Vernieuwen...
pt: Atualizando...
ru: Обновление...
zh: 正在刷新...

source: New / Changed Files
de: Neue / geänderte Dateien
es: Archivos nuevos / modificados
fr: Nouveaux / Fichiers modifiés
it: File nuovi / modificati
ja: 新規 / 変更されたファイル
nl: Nieuwe / gewijzigde bestanden
pt: Arquivos novos / alterados
ru: Новые / изменённые файлы
zh: 新建 / 已更改文件

source: No hits
de: Keine Treffer
es: Sin resultados
fr: Aucun résultat
it: Nessun risultato
ja: ヒットなし
nl: Geen resultaten
pt: Nenhum resultado
ru: Совпадений нет
zh: 无匹配结果

source: Content
de: Inhalt
es: Contenido
fr: Contenu
it: Contenuto
ja: 内容
nl: Inhoud
pt: Conteúdo
ru: Содержимое
zh: 内容

source: Filename
de: Dateiname
es: Nombre de archivo
fr: Nom de fichier
it: Nome file
ja: ファイル名
nl: Bestandsnaam
pt: Nome do arquivo
ru: Имя файла
zh: 文件名

source: Download PDF
de: PDF herunterladen
es: Descargar PDF
fr: Télécharger PDF
it: Scarica PDF
ja: PDF をダウンロード
nl: PDF downloaden
pt: Baixar PDF
ru: Скачать PDF
zh: 下载 PDF

source: Download file
de: Datei herunterladen
es: Descargar archivo
fr: Télécharger le fichier
it: Scarica file
ja: ファイルをダウンロード
nl: Bestand downloaden
pt: Baixar arquivo
ru: Скачать файл
zh: 下载文件

source: Copy as Base64
de: Als Base64 kopieren
es: Copiar como Base64
fr: Copier en Base64
it: Copia come Base64
ja: Base64 としてコピー
nl: Kopiëren als Base64
pt: Copiar como Base64
ru: Копировать как Base64
zh: 复制为 Base64

# contentCopied
source: Content copied to clipboard
de: Inhalt in Zwischenablage kopiert
es: Contenido copiado al portapapeles
fr: Contenu copié dans le presse-papiers
it: Contenuto copiato negli appunti
ja: 内容をクリップボードにコピーしました
nl: Inhoud gekopieerd naar klembord
pt: Conteúdo copiado para área de transferência
ru: Содержимое скопировано в буфер обмена
zh: 内容已复制到剪贴板

# base64Copied
source: Base64 data copied to clipboard
de: Base64-Daten in Zwischenablage kopiert
es: Datos Base64 copiados al portapapeles
fr: Données Base64 copiées dans le presse-papiers
it: Dati Base64 copiati negli appunti
ja: Base64 データをコピーしました
nl: Base64 gegevens gekopieerd naar klembord
pt: Dados Base64 copiados para área de transferência
ru: Данные Base64 скопированы в буфер обмена
zh: Base64 数据已复制

source: Download
es: Descargar
fr: Télécharger
it: Scarica
ja: ダウンロード
pt: Baixar
ru: Скачать
zh: 下载

source: File
de: Datei
es: Archivo
fr: Fichier
ja: ファイル
nl: Bestand
pt: Arquivo
ru: Файл
zh: 文件

source: Size
de: Größe
es: Tamaño
fr: Taille
it: Dimensione
ja: サイズ
nl: Grootte
pt: Tamanho
ru: Размер
zh: 大小

# noSourceConfigured
source: No source configured yet
de: Noch keine Quelle konfiguriert
es: Ninguna fuente configurada aún
fr: Aucune source configurée
it: Nessuna fonte configurata
ja: ソースがまだ設定されていません
nl: Nog geen bron geconfigureerd
pt: Nenhuma fonte configurada ainda
ru: Источник ещё не настроен
zh: 尚未配置来源

# addGitHubLink
source: Add a GitHub link, we automatically detect Owner / Repo / Branch / docs. Optionally you can set a token for private repos or higher limits.
de: Füge einen GitHub Link hinzu, wir erkennen Owner / Repo / Branch / docs automatisch. Optional kannst du ein Token für private Repos oder höhere Limits setzen.
es: Agrega un enlace de GitHub, detectamos automáticamente Owner / Repo / Branch / docs. Opcionalmente puedes establecer un token para repos privados o límites más altos.
fr: Ajoutez un lien GitHub, nous détectons automatiquement Owner / Repo / Branch / docs. Optionnellement, vous pouvez définir un jeton pour les repos privés ou des limites plus élevées.
it: Aggiungi un link GitHub, rileviamo automaticamente Owner / Repo / Branch / docs. Opzionalmente puoi impostare un token per repo privati o limiti più alti.
ja: GitHub リンクを追加すると、Owner / Repo / Branch / docs を自動認識します。オプションで Token を設定できます（プライベートリポジトリや上限緩和のため）。
nl: Voeg een GitHub link toe, we detecteren automatisch Owner / Repo / Branch / docs. Optioneel kun je een token instellen voor private repos of hogere limieten.
pt: Adicione um link do GitHub, detectamos automaticamente Owner / Repo / Branch / docs. Opcionalmente você pode definir um token para repos privados ou limites maiores.
ru: Добавьте ссылку на GitHub — приложение автоматически определит Owner / Repo / Branch / docs. При необходимости можно указать Token для частных репозиториев или увеличения лимита.
zh: 添加 GitHub 链接，我们会自动识别 Owner / Repo / Branch / docs。可选地设置 Token 以访问私有仓库或提高速率限制。

source: Quick Start
de: Schnellstart
es: Inicio rápido
fr: Démarrage rapide
it: Avvio rapido
ja: クイックスタート
nl: Snelle start
pt: Início rápido
ru: Быстрый старт
zh: 快速开始

source: Configure now
de: Jetzt konfigurieren
es: Configurar ahora
fr: Configurer maintenant
it: Configura ora
ja: 今すぐ設定
nl: Nu configureren
pt: Configurar agora
ru: Настроить сейчас
zh: 立即配置

# tipCanChange
source: Tip: You can later switch to another repo anytime in the menu »Change Source«.
de: Tipp: Du kannst später im Menü »Quelle ändern« jederzeit auf ein anderes Repo wechseln.
es: Consejo: Puedes cambiar a otro repo en cualquier momento en el menú »Cambiar fuente«.
fr: Astuce: Vous pouvez plus tard basculer vers un autre repo à tout moment dans le menu »Changer la source«.
it: Suggerimento: Puoi passare a un altro repo in qualsiasi momento nel menu »Cambia sorgente«.
ja: ヒント: 後で「ソースを変更」から他のリポジトリに切り替え可能です。
nl: Tip: Je kunt later altijd naar een andere repo switchen in het menu »Bron wijzigen«.
pt: Dica: Você pode mudar para outro repo a qualquer momento no menu »Alterar fonte«.
ru: Совет: вы можете позже сменить репозиторий через меню «Изменить источник».
zh: 提示：稍后可在菜单“更改来源”中切换到其他仓库。

# noTextFiles
source: No text files found
de: Keine Textdateien gefunden
es: No se encontraron archivos de texto
fr: Aucun fichier texte trouvé
it: Nessun file di testo trovato
ja: テキストファイルが見つかりません
nl: Geen tekstbestanden gevonden
pt: Nenhum arquivo de texto encontrado
ru: Текстовые файлы не найдены
zh: 未找到文本文件

source: Load error
de: Ladefehler
es: Error de carga
fr: Erreur de chargement
it: Errore di caricamento
ja: 読み込みエラー
nl: Laadfout
pt: Erro de carregamento
ru: Ошибка загрузки
zh: 加载错误

source: Check source
de: Quelle prüfen
es: Verificar fuente
fr: Vérifier la source
it: Controlla sorgente
ja: ソースを確認
nl: Bron controleren
pt: Verificar fonte
ru: Проверить источник
zh: 检查来源

# reloadFiles
source: Reload
de: Erneut laden
es: Recargar
fr: Recharger
it: Ricarica
ja: 再読み込み
nl: Opnieuw laden
pt: Recarregar
ru: Перезагрузить файлы
zh: 重新加载

source: No files loaded.
de: Keine Dateien geladen.
es: No se cargaron archivos.
fr: Aucun fichier chargé.
it: Nessun file caricato.
ja: ファイルが読み込まれていません。
nl: Geen bestanden geladen.
pt: Nenhum arquivo carregado.
ru: Файлы не загружены.
zh: 未加载任何文件。

source: Show file types
de: Dateitypen anzeigen
es: Mostrar tipos de archivo
fr: Afficher les types de fichiers
it: Mostra tipi di file
ja: ファイルタイプを表示
nl: Bestandstypes tonen
pt: Mostrar tipos de arquivo
ru: Показать типы файлов
zh: 显示文件类型

source: None
de: Keine
es: Ninguno
fr: Aucun
it: Nessuno
ja: なし
nl: Geen
pt: Nenhum
ru: Нет
zh: 无

source: All
de: Alle
es: Todo
fr: Tout
it: Tutto
ja: すべて
nl: Alle
pt: Todos
ru: Все
zh: 全部

source: Apply
de: Übernehmen
es: Aplicar
fr: Appliquer
it: Applica
ja: 適用
nl: Toepassen
pt: Aplicar
ru: Применить
zh: 应用

source: Source
de: Quelle
es: Fuente
it: Sorgente
ja: ソース
nl: Bron
pt: Fonte
ru: Источник
zh: 来源

source: Display
de: Anzeige
es: Pantalla
fr: Affichage
it: Visualizzazione
ja: 表示
nl: Weergave
pt: Exibição
ru: Отображение
zh: 显示

source: Language
de: Sprache
es: Idioma
fr: Langue
it: Lingua
ja: 言語
nl: Taal
pt: Idioma
ru: Язык
zh: 语言

source: Notifications
de: Benachrichtigungen
es: Notificaciones
it: Notifiche
ja: 通知
nl: Meldingen
pt: Notificações
ru: Уведомления
zh: 通知

# changesDialogOnStart
source: Show changes dialog on start
de: Änderungsdialog beim Start
es: Mostrar diálogo de cambios al inicio
fr: Afficher le dialogue des modifications au démarrage
it: Mostra dialogo cambiamenti all'avvio
ja: 起動時に変更ダイアログを表示
nl: Wijzigingsdialoog bij start tonen
pt: Mostrar diálogo de alterações ao iniciar
ru: Диалог изменений при запуске
zh: 启动时显示更改对话框

# changesDialogOnStartSubtitle
source: Automatically show new / changed files
de: Neue / geänderte Dateien automatisch anzeigen
es: Mostrar automáticamente archivos nuevos / modificados
fr: Afficher automatiquement les nouveaux / fichiers modifiés
it: Mostra automaticamente file nuovi / modificati
ja: 新規 / 変更されたファイルを自動的に表示
nl: Automatisch nieuwe / gewijzigde bestanden tonen
pt: Mostrar automaticamente arquivos novos / alterados
ru: Автоматически показывать новые / изменённые файлы
zh: 自动显示新建或已更改文件

# pollInterval
source: Interval for change check
de: Intervall für Änderungsprüfung
es: Intervalo para comprobación de cambios
fr: Intervalle pour vérification des modifications
it: Intervallo per controllo modifiche
ja: 変更チェック間隔
nl: Interval voor wijzigingscontrole
pt: Intervalo para verificação de alterações
ru: Интервал проверки изменений
zh: 更改检查间隔

# minutesSuffix
source: minutes
de: Minuten
es: minutos
it: minuti
ja: 分
nl: minuten
pt: minutos
ru: мин
zh: 分钟

# offOption
source: Off
de: Aus
es: Apagado
fr: Désactivé
it: Spento
ja: オフ
nl: Uit
pt: Desligado
ru: Выкл.
zh: 关闭

source: System notification on changes
de: System-Benachrichtigung bei Änderungen
es: Notificación del sistema en cambios
fr: Notification système lors de modifications
it: Notifica di sistema su modifiche
ja: 変更時のシステム通知
nl: Systeemmelding bij wijzigingen
pt: Notificação do sistema em alterações
ru: Системное уведомление при изменениях
zh: 更改时系统通知

# systemNotificationOnChangesSubtitle
source: Requires interval > 0
de: Erfordert Intervall > 0
es: Requiere intervalo > 0
fr: Nécessite intervalle > 0
it: Richiede intervallo > 0
ja: 間隔が 0 より大きい場合に必要です
nl: Vereist interval > 0
pt: Requer intervalo > 0
ru: Требуется интервал > 0
zh: 需要间隔大于 0

# cacheVersion
source: Cache version: v{version}
es: Versión de caché: v{version}
fr: Version du cache: v{version}
it: Versione cache: v{version}
ja: キャッシュバージョン: v{version}
nl: Cache-versie: v{version}
pt: Versão do cache: v{version}
ru: Версия кэша: v{version}
zh: 缓存版本：v{version}

# offlineSection
source: Offline
es: Sin conexión
fr: Hors ligne
ja: オフライン
ru: Оффлайн
zh: 离线

# offlineMode
source: Use offline mode
de: Offline-Modus verwenden
es: Usar modo sin conexión
fr: Utiliser le mode hors ligne
it: Usa modalità offline
ja: オフラインモードを使用
nl: Offline modus gebruiken
pt: Usar modo offline
ru: Использовать оффлайн-режим
zh: 使用离线模式

# offlineModeSubtitleEnabled
source: Files are read locally when possible
de: Dateien werden bevorzugt lokal gelesen
es: Los archivos se leen localmente cuando es posible
fr: Les fichiers sont lus localement lorsque possible
it: File letti localmente quando possibile
ja: ローカルファイルを優先して読み込みます
nl: Bestanden lokaal lezen indien mogelijk
pt: Arquivos lidos localmente quando possível
ru: Файлы читаются из локального кэша приоритетно
zh: 优先读取本地文件

# offlineModeSubtitleDisabled
source: Online (with cache fallback)
de: Online (mit Cache Fallback)
es: En línea (con respaldo de caché)
fr: En ligne (avec repli cache)
it: Online (con fallback cache)
ja: オンライン (キャッシュフォールバック付き)
nl: Online (met cache fallback)
pt: Online (com fallback de cache)
ru: Онлайн (с кэшированием при сбое)
zh: 在线（带缓存回退）

# snapshotRecreateTitle
source: Recreate snapshot
de: Snapshot neu erstellen
es: Recrear instantánea
fr: Recréer l'instantané
it: Ricrea snapshot
ja: スナップショットを再作成
nl: Snapshot opnieuw maken
pt: Recriar snapshot
ru: Пересоздать снимок
zh: 重新创建快照

# snapshotCreateTitle
source: Create snapshot
de: Snapshot erstellen
es: Crear instantánea
fr: Créer un instantané
it: Crea snapshot
ja: スナップショットを作成
nl: Snapshot maken
pt: Criar snapshot
ru: Создать снимок
zh: 创建快照

# snapshotRecreateSubtitle
source: Overwrite current offline snapshot
de: Aktuellen Offline-Snapshot überschreiben
es: Sobrescribir instantánea actual
fr: Écraser l'instantané hors ligne actuel
it: Sovrascrivi snapshot corrente
ja: 現在のオフラインスナップショットを上書きします
nl: Huidige offline snapshot overschrijven
pt: Sobrescrever snapshot offline atual
ru: Перезаписать текущий оффлайн-снимок
zh: 覆盖当前离线快照

# snapshotCreateSubtitle
source: Save all files locally
de: Alle Dateien lokal speichern
es: Guardar todos los archivos localmente
fr: Sauvegarder tous les fichiers localement
it: Salva tutti i file localmente
ja: すべてのファイルをローカルに保存
nl: Alle bestanden lokaal opslaan
pt: Salvar todos os arquivos localmente
ru: Сохранить все файлы локально
zh: 将所有文件保存到本地

# snapshotStarting
source: Starting snapshot...
de: Starte Snapshot...
es: Iniciando instantánea...
fr: Démarrage de l'instantané...
it: Avvio snapshot...
ja: スナップショットを開始中...
nl: Snapshot starten...
pt: Iniciando snapshot...
ru: Создание снимка...
zh: 正在创建快照...

# snapshotDone
source: Done
de: Fertig
es: Hecho
fr: Terminé
it: Fatto
ja: 完了
nl: Gereed
pt: Concluído
ru: Готово
zh: 完成

# snapshotDeleteTitle
source: Delete snapshot
de: Snapshot löschen
es: Eliminar instantánea
fr: Supprimer l'instantané
it: Elimina snapshot
ja: スナップショットを削除
nl: Snapshot verwijderen
pt: Excluir snapshot
ru: Удалить снимок
zh: 删除快照

# snapshotDeleteSubtitle
source: Remove locally stored files
de: Lokal gespeicherte Dateien entfernen
es: Eliminar archivos almacenados localmente
fr: Supprimer les fichiers stockés localement
it: Rimuovi file memorizzati localmente
ja: ローカルに保存されたファイルを削除
nl: Lokaal opgeslagen bestanden verwijderen
pt: Remover arquivos armazenados localmente
ru: Удалить локально сохранённые файлы
zh: 删除本地保存的文件

# snapshotDeleted
source: Deleted
de: Gelöscht
es: Eliminado
fr: Supprimé
it: Eliminato
ja: 削除されました
nl: Verwijderd
pt: Excluído
ru: Удалено
zh: 已删除
